_posts/2014-08-23-firefox-tabs.html
---
layout: post
title:  "The Joy of Clojure - Resurrecting Firefox Tabs"
date:   2014-08-23
categories:
---
<p>
This post isn't about the (awesome) book, it's about the immense ease and pleasure of interactive with data using Clojure.
</p>

<p>
Have you ever lost some tabs due to some browser hijinks (and a bit of goofing up)? I have recently. Rather than accept it, I decided to do some research and figure out that Firefox keeps all of this data in the deep dark corners of some json files. Knowing that, I fired up a repl with <code>lein try clojure.org/data.json</code> and began work.
</p>

<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">lein try clojure.org/data.json</span>
  <span style="color: #8c8c8c;">(</span>require '[<span style="color: #6434A3;">clojure.data.json</span> <span style="color: #D0372D;">:as</span> json]<span style="color: #8c8c8c;">)</span>

  <span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">home</span> <span style="color: #8c8c8c;">(</span><span style="color: #6434A3;">System</span><span style="color: #333333; background-color: #FFFFFF;">/</span>getenv <span style="color: #008000;">"HOME"</span><span style="color: #8c8c8c;">)</span> <span style="color: #008000;">"/.mozilla/firefox/something.default"</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">sessions</span> [<span style="color: #008000;">"sessionstore.bak"</span>
                 <span style="color: #008000;">"sessionstore.bak-20140611075517"</span>
                 <span style="color: #008000;">"sessionstore.js"</span>]<span style="color: #8c8c8c;">)</span>

  <span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">data</span> <span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">-&gt;&gt;</span> <span style="color: #8c8c8c;">(</span>nth sessions 0<span style="color: #8c8c8c;">)</span>
                 <span style="color: #8c8c8c;">(</span>str home <span style="color: #008000;">"/"</span><span style="color: #8c8c8c;">)</span>
                 slurp
                 <span style="color: #6434A3;">json</span><span style="color: #333333; background-color: #FFFFFF;">/</span>read-json<span style="color: #8c8c8c;">))</span>

  <span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">-&gt;&gt;</span> data
       <span style="color: #D0372D;">:_closedWindows</span>
       first
       <span style="color: #D0372D;">:tabs</span>
       <span style="color: #8c8c8c;">(</span>map #<span style="color: #8c8c8c;">(</span><span style="color: #0000FF;">-&gt;&gt;</span> <span style="color: #BA36A5;">%</span> <span style="color: #D0372D;">:entries</span> <span style="color: #8c8c8c;">(</span>map <span style="color: #D0372D;">:url</span><span style="color: #8c8c8c;">)))</span>
       <span style="color: #8c8c8c;">(</span>map last<span style="color: #8c8c8c;">)</span>
       <span style="color: #6434A3;">clojure.pprint</span><span style="color: #333333; background-color: #FFFFFF;">/</span>pprint<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
After a bit of playing around I had this and tabs were restored.
</p>
